In [1]:
#from sqlalchemy import create_engine, text

In [ ]:
####Part 1: Data Preparation

In [6]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.exc import SQLAlchemyError

# Define connection parameters
username = "root"
password = "ASPIREE15mysql"
database_name = "customer_orders_data1"  # replace with the database name
connection_string = f"mysql+mysqlconnector://{username}:{password}@localhost/{database_name}"

# Create SQLAlchemy engine
try:
    engine = create_engine(connection_string)
    connection = engine.connect()
    print("Database connection successful!")
except SQLAlchemyError as e:
    print(f"Database connection failed: {e}")

Database connection successful!

In [8]:
from sqlalchemy import text

# Create Customers and Orders tables
with engine.connect() as connection:
    # Create customers table
    connection.execute(text("""
    CREATE TABLE IF NOT EXISTS customers (
        customer_id INT PRIMARY KEY,
        name VARCHAR(255),
        email VARCHAR(255)
    );
    """))
    
    # Create orders table
    connection.execute(text("""
    CREATE TABLE IF NOT EXISTS orders (
        id INT PRIMARY KEY,
        display_order_id VARCHAR(255),
        total_amount DECIMAL(10, 2),
        created_at DATE,
        customer_id INT   
    );
    """))
    
print("Tables created successfully!")
#FOREIGN KEY (customer_id) REFERENCES customers(customer_id)

Tables created successfully!

In [10]:
import pandas as pd

# Load data from CSV files
try:
    customer_data = pd.read_csv("customers.csv")  # Correct the file name here
    order_data = pd.read_csv("order.csv")        # Correct the file name here

    # Check the data before importing
    print("CSV - Customer Data:")
    print(customer_data.head())  # Display first few rows of customer data

    print("CSV- Order Data:")
    print(order_data.head())      # Display first few rows of order data

    # Insert data into tables
    customer_data.to_sql("customers", con=engine, if_exists="append", index=False)
    order_data.to_sql("orders", con=engine, if_exists="append", index=False)
    print("Data imported successfully from database!")

except FileNotFoundError as e:
    print(f"Error: {e}. Please check if the CSV files exist in the correct directory.")

except Exception as e:
    print(f"An error occurred: {e}")

CSV - Customer Data:
   customer_id            name                       email
0            8  customer three         customer3@gmail.com
1            9  Shafran Naizer        mshafran13@gmail.com
2           10  Isuri Liyanage  liyanage.isukavi@gmail.com
3           12  Shafran Naizer            shafran@ieee.org
4           13          sss ss                 ss@ieee.org
CSV- Order Data:
      id display_order_id  total_amount        created_at  customer_id
0  13392             YTFA           425  10/14/2024 15:12       1251.0
1  13393             N1U7          1650  10/14/2024 15:17       1251.0
2  13394             PADV          1365  10/14/2024 17:02        468.0
3  13395             OKVW           525  10/14/2024 17:03       1251.0
4  13396             2G3Q           525  10/14/2024 17:04        468.0
Data imported successfully from database!

In [12]:
from sqlalchemy import create_engine, text

# Database connection
engine = create_engine("mysql+mysqlconnector://root:ASPIREE15mysql@localhost/customer_orders_data1")

# Verify the data import
with engine.connect() as connection:
    # Use the text() function for raw SQL
    customers = connection.execute(text("SELECT * FROM customers")).fetchall()
    orders = connection.execute(text("SELECT * FROM orders")).fetchall()

In [14]:
# Convert to DataFrame
df_customers = pd.DataFrame(customers, columns=['customer_id', 'name', 'email'])

# Display the DataFrame
df_customers.drop(columns=['email'])

      customer_id                       name
0               8             customer three
1               9             Shafran Naizer
2              10             Isuri Liyanage
3              12             Shafran Naizer
4              13                     sss ss
...           ...                        ...
3337         1270               Alex Johnson
3338         1271  Dinuka Kaveen Dominguhewa
3339         1272                        K L
3340         1273                  fdv dfvfd
3341         1274           Limani Ratnayake

[3342 rows x 2 columns]

In [17]:
df_orders = pd.DataFrame(orders, columns=['id', 'display_order_id', 'total_amount', 'created_at', 'customer_id'])
df_orders.drop(columns=['display_order_id'])


df_orders

          id display_order_id  total_amount        created_at  customer_id
0      13392             YTFA           425  10/14/2024 15:12       1251.0
1      13393             N1U7          1650  10/14/2024 15:17       1251.0
2      13394             PADV          1365  10/14/2024 17:02        468.0
3      13395             OKVW           525  10/14/2024 17:03       1251.0
4      13396             2G3Q           525  10/14/2024 17:04        468.0
...      ...              ...           ...               ...          ...
24346    814             CQOU        450000     3/3/2022 6:24         58.0
24347    826             RERN        125000    3/3/2022 10:17         58.0
24348    830             D6KG        260000    3/3/2022 11:47         58.0
24349    845             O5PZ        125000     3/4/2022 1:30         58.0
24350    867             SZXV        125000    3/4/2022 10:53         58.0

[24351 rows x 5 columns]

In [21]:
df_orders['customer_id'] = df_orders['customer_id'].fillna(0)
count_customer_id_zero = (df_orders['customer_id'] == 0).sum()

print(f"Count of customer_id equal to 0: {count_customer_id_zero}")

Count of customer_id equal to 0: 375

In [23]:
df_orders['customer_id'] = df_orders['customer_id'].astype(int)

In [25]:
df_orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24351 entries, 0 to 24350
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   id                24351 non-null  int64
 1   display_order_id  24243 non-null  object
 2   total_amount      24351 non-null  int64
 3   created_at        24351 non-null  object
 4   customer_id       24351 non-null  int32
dtypes: int32(1), int64(2), object(2)
memory usage: 856.2+ KB

In [27]:

# Merging DataFrames
merged_df = pd.merge(df_orders, df_customers, on='customer_id', how='left')

# Display the merged DataFrame
merged_df

,id,display_order_id,total_amount,created_at,customer_id,name,email
0,13392,YTFA,425,10/14/2024 15:12,1251,Isuri Liyanage,liyanage.isukavi@gmail.com
1,13392,YTFA,425,10/14/2024 15:12,1251,Isuri Liyanage,liyanage.isukavi@gmail.com
2,13392,YTFA,425,10/14/2024 15:12,1251,Isuri Liyanage,liyanage.isukavi@gmail.com
3,13393,N1U7,1650,10/14/2024 15:17,1251,Isuri Liyanage,liyanage.isukavi@gmail.com
4,13393,N1U7,1650,10/14/2024 15:17,1251,Isuri Liyanage,liyanage.isukavi@gmail.com
...,...,...,...,...,...,...,...
71050,845,O5PZ,125000,3/4/2022 1:30,58,Anonymous,None
71051,845,O5PZ,125000,3/4/2022 1:30,58,Anonymous,None
71052,867,SZXV,125000,3/4/2022 10:53,58,Anonymous,None
71053,867,SZXV,125000,3/4/2022 10:53,58,Anonymous,None
71054,867,SZXV,125000,3/4/2022 10:53,58,Anonymous,None

In [29]:
# Filter the merged DataFrame to get rows where customer_id is 0
zero_customer_id_df = merged_df[merged_df['customer_id'] == 0]

# Display the filtered DataFrame
zero_customer_id_df

,id,display_order_id,total_amount,created_at,customer_id,name,email
7622,1463,5571,130,5/6/2022 11:27,0,NaN,NaN
7626,1465,288,130,5/9/2022 13:24,0,NaN,NaN
7627,1466,5930,130,5/9/2022 13:29,0,NaN,NaN
7628,1471,3296,100,5/17/2022 11:05,0,NaN,NaN
7629,1472,3296,100,5/17/2022 11:05,0,NaN,NaN
...,...,...,...,...,...,...,...
67678,378,3300B,2390,1/26/2022 10:12,0,NaN,NaN
67733,514,753C5,1558,2/3/2022 16:48,0,NaN,NaN
67734,515,390B3,1667,2/3/2022 16:52,0,NaN,NaN
67735,516,75964,1667,2/3/2022 16:54,0,NaN,NaN
67736,517,E309D,1667,2/3/2022 17:20,0,NaN,NaN

In [ ]:
###### Part 3: Data Analysis

In [ ]:
# Step 1: Aggregate Data for Model Preparation

# We need to calculate the total_orders and total_revenue for each customer, then create a binary target variable, repeat_purchaser.

# Group by customer_id to calculate the total revenue and the count of orders.
# Create a target variable: Set repeat_purchaser to 1 if a customer has more than one order, otherwise 0.

In [42]:
import pandas as pd

# Aggregate total revenue and total orders per customer
customer_stats = merged_df.groupby('customer_id').agg(
    total_revenue=('total_amount', 'sum'),
    total_orders=('id', 'count')
).reset_index()

# Create the target variable (1 if repeat purchaser, 0 otherwise)
customer_stats['repeat_purchaser'] = (customer_stats['total_orders'] > 1).astype(int)

# Display the first few rows to verify
customer_stats

     customer_id  total_revenue  total_orders  repeat_purchaser
0              0         461025           375                 1
1              8         247500            99                 1
2              9          61173            18                 1
3             10         280800           108                 1
4             12         154800            63                 1
..           ...            ...           ...               ...
658       100004          25200            18                 1
659       100005          32400            15                 1
660       100009          16800            21                 1
661       100010          26100             9                 1
662       100012           2400             3                 1

[663 rows x 4 columns]

In [ ]:
# Step 2: Check Data Balance and Sufficiency
# Before proceeding, let's validate:

# Check if repeat_purchaser contains both classes (0 and 1) to ensure model training is feasible.
# Ensure thereâ€™s sufficient data for training

In [44]:
# Check if there are enough samples and both classes

if customer_stats['repeat_purchaser'].nunique() < 2:
    print("The target variable has only one class. We need both classes (0 and 1) to train the model.")
elif customer_stats.shape[0] < 50:
    print("Not enough data to train a reliable model.")
else:
    print("Data is sufficient for training.")

The target variable has only one class. We need both classes (0 and 1) to train the model.

In [ ]:
# Step 3: Prepare Data for Model Training
# If the data checks pass, weâ€™ll move to feature and target selection, and split the dataset into training and testing sets.

In [46]:
from sklearn.model_selection import train_test_split

# Features and target
X = customer_stats[['total_orders', 'total_revenue']]
y = customer_stats['repeat_purchaser']

# Split into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.3, random_state=42)

print("Training and test data prepared.")

Training and test data prepared.

In [ ]:
# Step 4: Train the Logistic Regression Model
# Train the model on the training data.
# Add a try-except block to catch potential training error

In [48]:
from sklearn.linear_model import LogisticRegression

# Train the logistic regression model
try:
    model = LogisticRegression()
    model.fit(X_train, y_train)
    print("Model training complete.")
except ValueError as e:
    print(f"Error during model training: {e}")

Error during model training: This solver needs samples of at least 2 classes in the data, but the data contains only one class: 1

In [57]:

# Step 5: Predict and Evaluate Model Performance
# Make predictions on the test data.
# Calculate accuracy as a measure of the model's performance.

In [59]:
from sklearn.metrics import accuracy_score

# Predict on the test set and evaluate accuracy
y_pred = model.predict(X_test)
accuracy = accuracy_score(y_test, y_pred)

print(f"Model Accuracy: {accuracy * 100:.2f}%")

AttributeError: 'LogisticRegression' object has no attribute 'coef_'